## Plan Result (parser-graphql-wrapper-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/162838)



<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_elasticache_serverless_cache.serverless_redis_v2_elasticache_serverless_6AA48CC1
  * aws_security_group.serverless_redis_v2_elasticache_security_group_668D35F4



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_elasticache_serverless_cache.serverless_redis_v2_elasticache_serverless_6AA48CC1 will be created
  + resource "aws_elasticache_serverless_cache" "serverless_redis_v2_elasticache_serverless_6AA48CC1" {
      + arn                      = (known after apply)
      + create_time              = (known after apply)
      + daily_snapshot_time      = (known after apply)
      + description              = "Redis for ParserGraphQLWrapper-Prod-serverless-v2"
      + endpoint                 = (known after apply)
      + engine                   = "redis"
      + full_engine_version      = (known after apply)
      + id                       = (known after apply)
      + major_engine_version     = (known after apply)
      + name                     = "parsergraphqlwrapper-prod-serverless-v2"
      + reader_endpoint          = (known after apply)
      + security_group_ids       = [
          + (known after apply),
        ]
      + snapshot_retention_limit = (known after apply)
      + status                   = (known after apply)
      + subnet_ids               = [
          + "subnet-610bdb3b",
          + "subnet-b2a036fa",
          + "subnet-cc66bde0",
        ]
      + tags                     = {
          + "costCenter"  = "Shared"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "ParserGraphQLWrapper"
        }
      + tags_all                 = {
          + "costCenter"  = "Shared"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "ParserGraphQLWrapper"
        }

      + cache_usage_limits {
          + data_storage {
              + maximum = 7
              + unit    = "GB"
            }
        }
    }

  # aws_security_group.serverless_redis_v2_elasticache_security_group_668D35F4 will be created
  + resource "aws_security_group" "serverless_redis_v2_elasticache_security_group_668D35F4" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.16.0.0/16",
                ]
              + description      = ""
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "ParserGraphQLWrapper-Prod-serverless-v2"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "costCenter"  = "Shared"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "ParserGraphQLWrapper"
        }
      + tags_all               = {
          + "costCenter"  = "Shared"
          + "environment" = "Prod"
          + "owner"       = "Pocket"
          + "service"     = "ParserGraphQLWrapper"
        }
      + vpc_id                 = "vpc-867638e3"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"dc449a83-7648-43ba-991b-97b69af90525","JobName":"parser-graphql-wrapper_infrastructure_plan_prod","PRNumber":503,"Program":"tfcmt","SHA1":"715ff85a2c9287827419ce49faf65097f52a8052","Target":"parser-graphql-wrapper-cdk","Vars":{}} -->